public/readinglist.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My readinglist</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css"/>
</head>
<body>
<div id="preamble" class="status">
<nav>
    <div class="left">
      <a href="/index.html">Home</a> |
      <a href="/systems/index.html">Systems</a> |
      <a href="/articles/index.html">Articles</a> |
      <a href="/about.html">About</a> |
      <a href="/cv.html">CV</a> |
      <a href="/readinglist.html">Readinglist</a> |
      <a href="/emacs/index.html">Sitemap</a> |
      <a href="/nixos/index.html">Code</a>
    </div>
    </nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">My readinglist</h1>
</header><p>
Just a list of books I have read or want to read. Should be treated as a nightboard stand of unread books.
</p>

<div id="outline-container-orgf5f8b96" class="outline-2">
<h2 id="orgf5f8b96">Technical and non-fiction</h2>
<div class="outline-text-2" id="text-orgf5f8b96">
<p>
I like to read and learn new technical stuff. This is whats on my agenda.
It closly resembles my obsesisons at the moment which is computer programming(first Lisp then Haskell then idk &#x2026; Rust or Golang perhaps) and Operating Systems(Unix/Linux, NixOS, Kubernetes and Plan9).
<b>And Emacs</b>. 
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> An Introduction to Programming in Emacs Lisp by Robert J. Chassell</li>
<li class="off"><code>[&#xa0;]</code> <a href="https://htdp.org/2022-8-7/Book/index.html">How to Design Programs, Second Edition</a> by Matthias Felleisen, Robert Bruce Findler, Matthew Flatt, Shriram Krishnamurthi</li>
<li class="off"><code>[&#xa0;]</code> UNIX A History and a Memoir by Brian Kernighan</li>
<li class="off"><code>[&#xa0;]</code> The Little Schemer by Daniel P. Friedman and Matthias Felleisen</li>
<li class="off"><code>[&#xa0;]</code> The Purely Functional Software Deployment Model by Eelco Dolstra</li>
<li class="off"><code>[&#xa0;]</code> Structure and Interpretation of Computer Programs by Harold Abelson and Gerald Jay Sussman with Julie Sussman</li>
<li class="off"><code>[&#xa0;]</code> <a href="http://learnyouahaskell.com/">Learn You Haskell for Greate Good!</a> by Miran Lipovača</li>
</ul>
</div>
</div>

<div id="outline-container-org0328b1c" class="outline-2">
<h2 id="org0328b1c">Fiction</h2>
<div class="outline-text-2" id="text-org0328b1c">
<p>
I like to read fiction and I've done it for all my life, which is close to fifty years. But in the last couple of years I've found it hard to do, because of the state of the world. If things ever calm down I'll read more fiction.
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> by Kim Stanley Robertson</li>
</ul>
</div>
</div>
<div id="outline-container-org47f8321" class="outline-2">
<h2 id="org47f8321">Viewing</h2>
<div class="outline-text-2" id="text-org47f8321">
<p>
Might be ok to have a section to track some of the things I'm watching and want to watch.
</p>
</div>

<div id="outline-container-org3cb526d" class="outline-3">
<h3 id="org3cb526d">Tech</h3>
<div class="outline-text-3" id="text-org3cb526d">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <a href="https://www.youtube.com/playlist?list=PLE18841CABEA24090">MIT 6.001 Structure and Interpretation of Computer Programs, Spring 2005</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgab0d3ee" class="outline-3">
<h3 id="orgab0d3ee">Series/Films</h3>
<div class="outline-text-3" id="text-orgab0d3ee">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> </li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</p>
</div>
</body>
</html>
